tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "python@3.10"
brew "csvkit"
brew "docker"
brew "efm-langserver"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "exa"
brew "fd"
brew "gh"
brew "git"
brew "git-delta"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "lua-language-server"
brew "luajit", args: ["HEAD"]
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "node@14"
brew "node@16"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustfmt"
brew "rustup-init"
brew "tmux"
brew "tree"
cask "alacritty"
cask "amethyst"
cask "betterdisplay"
cask "bitwarden"
cask "figma"
cask "firefox"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "neovide"
cask "postman"
cask "slack"
cask "spotify"
cask "telegram"
cask "wkhtmltopdf"
