tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "awscli"
brew "bat"
brew "btop"
brew "gettext"
brew "cmake"
brew "csvkit"
brew "curl"
brew "efm-langserver"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gopls"
brew "harper"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "ninja"
brew "pandoc"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "nikitabobko/tap/aerospace"
cask "bitwarden"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "mos"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "sony-ps-remote-play"
cask "spotify"
cask "telegram"
cask "wezterm"
cask "zed"
go "sandbox"
npm "@github/copilot"
npm "@tailwindcss/language-server"
npm "@vtsls/language-server"
npm "bash-language-server"
npm "cssmodules-language-server"
npm "gh-actions-language-server"
npm "pnpm"
npm "prettier-output-config"
npm "prettier"
npm "serve"
npm "tombi"
npm "typescript"
npm "vscode-langservers-extracted"
npm "yaml-language-server"
