tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "awscli"
brew "bat"
brew "btop"
brew "csvkit"
brew "efm-langserver"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gopls"
brew "harper"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "postgresql@14", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "wireguard-tools"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "bitwarden"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "mos"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "sony-ps-remote-play"
cask "spotify"
cask "telegram"
cask "wezterm"
cask "zed"
cask "zoom"
go "sandbox"
