tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "awscli"
brew "bat"
brew "btop"
brew "csvkit"
brew "efm-langserver"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "tree-sitter"
brew "neovim"
brew "node@22"
brew "opam"
brew "pandoc"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14", restart_service: :changed
brew "python@3.10"
brew "ripgrep"
brew "stylua"
brew "tmux"
brew "tree"
brew "wireguard-tools"
brew "yarn"
brew "zellij"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "qmk/qmk/qmk"
cask "aerospace"
cask "alacritty"
cask "alt-tab"
cask "amethyst"
cask "arc"
cask "balenaetcher"
cask "betterdisplay"
cask "bitwarden"
cask "figma"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "mos"
cask "obsidian"
cask "postman"
cask "qmk-toolbox"
cask "raycast"
cask "spotify"
cask "telegram"
cask "wezterm"
cask "zoom"
