tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "nikitabobko/tap"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "btop"
brew "libpng"
brew "cairo"
brew "efm-langserver"
brew "giflib"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "icu4c@76"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "pango"
brew "librsvg"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "tree-sitter"
brew "neovim"
brew "pinentry-mac"
brew "pkgconf"
brew "ripgrep"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "aws-vault-binary"
cask "bitwarden"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mos"
cask "postman"
cask "raycast"
cask "slack"
cask "wezterm"
