tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "nikitabobko/tap"
brew "awscli"
brew "bat"
brew "btop"
brew "libpng"
brew "cairo"
brew "efm-langserver"
brew "giflib"
brew "icu4c@76"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "tree-sitter"
brew "neovim"
brew "node@20"
brew "pango"
brew "phrase-cli"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "postgresql@14", restart_service: true
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "stylua"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
cask "aerospace"
cask "alacritty"
cask "alt-tab"
cask "amethyst"
cask "aws-vault"
cask "bitwarden"
cask "docker"
cask "figma"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mos"
cask "podman-desktop"
cask "postman"
cask "raycast"
cask "slack"
cask "wezterm"
cask "zoom"
